blog/37.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-02 Wed 23:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 4.2.3 Streams as Lazy Lists</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 4.2.3 Streams as Lazy Lists
<br />
<span class="subtitle">2024-10-02 Wed</span>
</h1>
<p>
Authors show a relatively easy implementation of streams as of lazy
lists.
</p>

<p>
Given that our evaluator is now lazy, we can simply reimplement
<code>cons</code>, <code>car</code>, <code>cdr</code> as compound procedures in this way:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cons</span> x y)
  (<span style="color: #531ab6;">lambda</span> (m) (m x y)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">car</span> z)
  (z (<span style="color: #531ab6;">lambda</span> (p q) p)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">cdr</span> z)
  (z (<span style="color: #531ab6;">lambda</span> (p q) q)))
</pre>
</div>

<p>
The streams presented in Chapter 3 were lazy at construction time with
respect to the <code>cdr</code> and non-lazy with respect to everything else.
</p>

<p>
The lazy lists presented in this chapter are lazy at both construction
time and selection time with respect to both the <code>car</code> and the
<code>cdr</code>. Delayed values are forced only when they are ``really needed
&#x2014; e.g., for use as the argument of a primitive, or to be printed as
an answer'' (410).
</p>
<div id="outline-container-org17a4b05" class="outline-2">
<h2 id="org17a4b05">Exercise 4.32</h2>
<div class="outline-text-2" id="text-org17a4b05">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Give some examples that illustrate the difference between the streams
of chapter 3 and the ``lazier'' lazy lists described in this section.
How can you take advantage of this extra laziness?
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
First of all, here is a way in which we can add the lazy lists feature
to the evaluator:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;; </span><span style="color: #595959;">add replace scheme's cons, car and cdr with our implementations</span>
(<span style="color: #531ab6;">define</span> <span style="color: #721045;">primitive-procedures</span>
  (list (list 'cons (<span style="color: #531ab6;">lambda</span> (x y)
                      (list 'lazy-list (<span style="color: #531ab6;">lambda</span> (m) (m x y)))))
        (list 'car (<span style="color: #531ab6;">lambda</span> (z)
                     ((cadr z) (<span style="color: #531ab6;">lambda</span> (p q) p))))
        (list 'cdr (<span style="color: #531ab6;">lambda</span> (z)
                     ((cadr z) (<span style="color: #531ab6;">lambda</span> (p q) q))))
        (list 'null? null?)
        (list '= =)
        (list '+ +)
        (list '- -)
        (list '* *)
        (list '/ /)
        (list 'newline newline)
        (list 'display display)))
</pre>
</div>

<p>
Here are a couple of examples.
</p>

<p>
In normal scheme (I'm using racket), <code>cons</code> is strict in both
arguments:
</p>
<div class="org-src-container">
<pre class="src src-scheme">#lang sicp
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">foo</span>)
  (display <span style="color: #3548cf;">"foo!"</span>)
  (newline)
  <span style="color: #3548cf;">"foo"</span>)

(cons (foo) (foo))
<span style="color: #595959;">;; </span><span style="color: #595959;">foo!</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">foo!</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">("foo" . "foo")</span>
</pre>
</div>

<p>
The <code>cons</code> of chapter 3 is strict in the first argument and non-strict
in the second:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">foo</span>)
  (display <span style="color: #3548cf;">"foo!"</span>)
  (newline)
  <span style="color: #3548cf;">"foo"</span>)

(cons-stream (foo) (foo))
<span style="color: #595959;">;; </span><span style="color: #595959;">foo!</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">("foo" . #&lt;promise&gt;)</span>
</pre>
</div>

<p>
The <code>cons</code> of chapter 4 is non-strict on both arguments:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">foo</span>)
  (display <span style="color: #3548cf;">"foo!"</span>)
  (newline)
  <span style="color: #3548cf;">"foo"</span>)

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
ok

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(cons (foo) (foo))

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
(compound-procedure (m) ((m x y)) <span style="color: #005f5f;">&lt;procedure-env&gt;</span>)
</pre>
</div>

<p>
Here is an example of the extra-lazyness Authors mention:
</p>

<p>
With the streams of chapter 3, calling <code>stream-cdr</code> forces the <code>cdr</code>:
</p>
<div class="org-src-container">
<pre class="src src-scheme">#lang sicp
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">stream-car</span> stream) (car stream))
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">stream-cdr</span> stream) (<span style="color: #531ab6;">force</span> (cdr stream)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">foo</span>)
  (display <span style="color: #3548cf;">"foo!"</span>)
  (newline)
  <span style="color: #3548cf;">"foo"</span>)

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">foovar</span> (cons-stream (foo) (foo)))
<span style="color: #595959;">;; </span><span style="color: #595959;">foo!</span>

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">foovarcar</span> (stream-car foovar))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">foovarcdr</span> (stream-cdr foovar))
<span style="color: #595959;">;; </span><span style="color: #595959;">foo!</span>
</pre>
</div>

<p>
With the lazy lists of chapter 4, neither the application of <code>cdr</code> nor
that of <code>car</code> forces delayed value:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">foo</span>) (display <span style="color: #3548cf;">"foo!"</span>) (newline) <span style="color: #3548cf;">"foo"</span>)

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
ok

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(<span style="color: #531ab6;">define</span> <span style="color: #721045;">foovar</span> (cons (foo) (foo)))

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
ok

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(<span style="color: #531ab6;">define</span> <span style="color: #721045;">foovarcar</span> (car foovar))

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
ok

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(<span style="color: #531ab6;">define</span> <span style="color: #721045;">foovarcdr</span> (cdr foovar))

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
ok
</pre>
</div>

<p>
The streams of Chapter 3 are lazy at construction time with respect to
the <code>cdr</code>. They are non-lazy with respect to everything else.
</p>

<p>
The lazy lists of Chapter 4 are lazy both at construction time and at
selection time with respect to both the <code>car</code> and the <code>cdr</code>. Delayed
values are forced only when they are ``really needed &#x2014; e.g., for use
as the argument of a primitive, or to be printed as an answer.''
</p>

<p>
We can take advantage of the fact that the actual value of the <code>car</code>
is not computed at construction time. If the application of <code>foo</code>
involves a lot of computations, then <code>(cons-stream (foo) nil)</code> will
make them, wheres the lazy <code>cons</code> of chapter 4 won't.
</p>

<p>
And we can take advantage of the fact that the selection of the <code>cdr</code>
does not entail its actual value in situation where its actual value
is not needed. For example, computing the length of a
stream/lazy-list:
</p>

<p>
Streams of chapter 3:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">stream-car</span> stream) (car stream))
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">stream-cdr</span> stream) (<span style="color: #531ab6;">force</span> (cdr stream)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">foo</span>)
  (display <span style="color: #3548cf;">"foo!"</span>)
  (newline)
  <span style="color: #3548cf;">"foo"</span>)

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">foolist</span>
  (cons-stream (foo)
               (cons-stream (foo)
                            (cons-stream (foo) nil))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">length</span> stream-items)
  (<span style="color: #531ab6;">if</span> (stream-null? stream-items)
      0
      (+ 1 (length (stream-cdr stream-items)))))

(length foolist)

<span style="color: #595959;">;; </span><span style="color: #595959;">foo!</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">foo!</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">foo!</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">3</span>
</pre>
</div>

<p>
Lazy lists of chapter 4:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">length</span> items) (<span style="color: #531ab6;">if</span> (null? items) 0 (+ 1 (length (cdr items)))))

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
ok

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">foo</span>) (display <span style="color: #3548cf;">"foo!"</span>) (newline) <span style="color: #3548cf;">"foo"</span>)

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
ok

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(<span style="color: #531ab6;">define</span> <span style="color: #721045;">foolist</span> (cons (foo) (cons (foo) (cons (foo) '()))))

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
ok

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval input:</span>
(length foolist)

<span style="color: #595959;">;;; </span><span style="color: #595959;">L-Eval value:</span>
3
</pre>
</div>
</div>
</div>
<div id="outline-container-org594ef8e" class="outline-2">
<h2 id="org594ef8e">Exercise 4.33</h2>
<div class="outline-text-2" id="text-org594ef8e">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Ben Bitdiddle tests the lazy list implementation given above by
evaluating the expression
</p>

<div class="org-src-container">
<pre class="src src-scheme">(car '(a b c))
</pre>
</div>

<p>
To his surprise, this produces an error.  After some thought, he
realizes that the "lists" obtained by reading in quoted expressions
are different from the lists manipulated by the new definitions of
`cons', `car', and `cdr'.  Modify the evaluator's treatment of quoted
expressions so that quoted lists typed at the driver loop will produce
true lazy lists.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">is-non-empty-list?</span> exp)
  (<span style="color: #531ab6;">and</span> (quoted? exp)
       (list? (text-of-quotation exp))
       (not (null? (text-of-quotation exp)))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">list-&gt;cons</span> exp)
    (<span style="color: #531ab6;">if</span> (null? exp)
        ''()
        (list
         'cons
         (car exp)
         (list-&gt;cons (cdr exp)))))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval</span> exp env)
  (<span style="color: #531ab6;">cond</span> ((self-evaluating? exp) exp)
        ((variable? exp) (lookup-variable-value exp env))
        ((is-non-empty-list? exp) (eval (list-&gt;cons (cadr exp)) env))<span style="color: #595959;">;;</span><span style="color: #595959;">&lt;-------------</span>
        ((quoted? exp) (text-of-quotation exp))
        ((assignment? exp) (eval-assignment exp env))
        ((definition? exp) (eval-definition exp env))
        ((if? exp) (eval-if exp env))
        ((lambda? exp)
         (make-procedure (lambda-parameters exp)
                         (lambda-body exp)
                         env))
        ((begin? exp)
         (eval-sequence (begin-actions exp) env))
        ((cond? exp) (eval (cond-&gt;if exp) env))
        ((application? exp)
         (apply-evaluator (actual-value (operator exp) env)
                          (operands exp)
                          env))
        (<span style="color: #531ab6;">else</span>
         (error <span style="color: #3548cf;">"Unknown expression type -- EVAL"</span> exp))))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge98805b" class="outline-2">
<h2 id="orge98805b">Exercise 4.34</h2>
<div class="outline-text-2" id="text-orge98805b">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Modify the driver loop for the evaluator so that lazy pairs and lists
will print in some reasonable way.  (What are you going to do about
infinite lists?)  You may also need to modify the representation of
lazy pairs so that the evaluator can identify them in order to print
them.
</p>
</blockquote>

<p>
In order to make lazy lists recognizable (to tell them apart from
other compound procedures), we can change the implementation of <code>cons</code>
(and, accordingly, that of as <code>car</code> and that of <code>cdr</code>) by adding a tag
in front of the lazy lists representation we already have:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> <span style="color: #721045;">primitive-procedures</span>
  (list (list 'cons (<span style="color: #531ab6;">lambda</span> (x y)
                      (list 'lazy-list (<span style="color: #531ab6;">lambda</span> (m) (m x y)))))
        (list 'car (<span style="color: #531ab6;">lambda</span> (z)
                     ((cadr z) (<span style="color: #531ab6;">lambda</span> (p q) p))))
        (list 'cdr (<span style="color: #531ab6;">lambda</span> (z)
                     ((cadr z) (<span style="color: #531ab6;">lambda</span> (p q) q))))
        (list 'null? null?)
        (list '= =)
        (list '+ +)
        (list '- -)
        (list '* *)
        (list '/ /)
        (list 'newline newline)
        (list 'display display)))
</pre>
</div>

<p>
Now that lazy-list have been made recognizable, we can modify the
printing rules (<code>user-print</code>) so that lazy list are taken into account
as a special case.
</p>

<p>
An easy way to deal with printing lazy lists is to display the first
element only and then some ellipses. What better approaches are there?
</p>

<div class="org-src-container">
<pre class="src src-scheme">  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lazy-list?</span> exp)
    (tagged-list? exp 'lazy-list))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">user-print</span> object)
  (<span style="color: #531ab6;">cond</span> ((compound-procedure? object)
         (display (list 'compound-procedure
                        (procedure-parameters object)
                        (procedure-body object)
                        '<span style="color: #005f5f;">&lt;procedure-env&gt;</span>)))
        ((lazy-list? object)
         (display (list (lazy-car object) '...)))
        (<span style="color: #531ab6;">else</span> (display object))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">;;; L-Eval input:
'(1 2 3)

;;; L-Eval value:
(1 ...)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div style="text-align: center;"><a href="./posts.html">←</a></div><p>Send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> for comments.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.0.60 (<a href="https://orgmode.org">Org</a> mode 9.7.9)</span></p>
</div>
</body>
</html>
